{
"movies":[
  {"movieName":"The Batman",
  "movieExplanation":"When the Riddler, a sadistic serial killer, begins murdering key political figures in Gotham, Batman is forced to investigate the city's hidden corruption and question his family's involvement.",
  "imdbPoint":8.3,
  "imgUrl":"https://www.cumhuriyet.com.tr/Archive/2022/3/4/1912768/kapak_070232.jpg"},
 
  {"movieName":"Derin Sular", 
  "movieExplanation":"A well-to-do husband who allows his wife to have affairs in order to avoid a divorce becomes a prime suspect in the disappearance of her lovers.",
  "imdbPoint":5.4,
  "imgUrl":"https://i0.wp.com/blog-okur.com/wp-content/uploads/2022/03/Derin-Sular-Film-Konusu-ve-Yorumu-%E2%80%93-Hulu.jpeg?fit=1024%2C684&ssl=1"},
    
    {"movieName":"X (II)", 
  "movieExplanation":"In 1979, a group of young filmmakers set out to make an adult film in rural Texas, but when their reclusive, elderly hosts catch them in the act, the cast find themselves fighting for their lives.",
  "imdbPoint":7.3,
  "imgUrl":"https://i.ytimg.com/vi/Awg3cWuHfoc/maxresdefault.jpg"},
   
    {"movieName":"The Adam Project", 
  "movieExplanation":"After accidentally crash-landing in 2022, time-traveling fighter pilot Adam Reed teams up with his 12-year-old self for a mission to save the future.",
  "imdbPoint":6.7,
  "imgUrl":""},
    
    {"movieName":"Kırmızı", 
  "movieExplanation":"A 13-year-old girl named Meilin turns into a giant red panda whenever she gets too excited.",
  "imdbPoint":7.1,
  "imgUrl":""},
   
    {"movieName":"Düşeş", 
  "movieExplanation":"A man breaks into a tech billionaire's empty vacation home, but things go sideways when the arrogant mogul and his wife arrive for a last-minute getaway.",
  "imdbPoint":5.7,
  "imgUrl":""},
   {"movieName":"Kara Yengeç", 
  "movieExplanation":"In a post-apocalyptic world, six soldiers on a covert mission must transport a mysterious package across a frozen archipelago. Noomi Rapace stars.",
  "imdbPoint":5.6,
  "imgUrl":""},
   {"movieName":"Kayıp Şehir", 
  "movieExplanation":"A reclusive romance novelist on a book tour with her cover model gets swept up in a kidnapping attempt that lands them both in a cutthroat jungle adventure.",
  "imdbPoint":6.7,
  "imgUrl":""},
   {"movieName":"Fresh", 
  "movieExplanation":"The horrors of modern dating seen through one young woman's defiant battle to survive her new boyfriend's unusual appetites.",
  "imdbPoint":6.7,
  "imgUrl":""},
   {"movieName":"Ambulans", 
  "movieExplanation":"Two robbers steal an ambulance after their heist goes awry.",
  "imdbPoint":6.5,
  "imgUrl":""}
]
}